In [1]:
from acquire import acquire_data
from wrangle import wrangle_data

import numpy as np
import pandas as pd

# Get the Data

In [2]:
df = acquire_data()

csv has been previously generated.
Data Acquired

In [3]:
df.head()

,Unnamed: 0,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,fips,FIPS,Name,State
0,0,3.0,2.0,1458.0,136104.0,6037.0,6037,Los Angeles,CA
1,1,2.0,1.0,1421.0,35606.0,6037.0,6037,Los Angeles,CA
2,2,3.0,2.0,1650.0,614000.0,6037.0,6037,Los Angeles,CA
3,3,2.0,1.0,693.0,274237.0,6037.0,6037,Los Angeles,CA
4,4,0.0,0.0,1378.0,168828.0,6037.0,6037,Los Angeles,CA

## Clean the Data

In [4]:
# Dropping the weird unnamed (but named) column that came over from the csv
# The fips columns were useful for merging the two dataframes together, but now we can drop them
df.drop(columns=['Unnamed: 0','fips', 'FIPS'], inplace=True)

In [5]:
df.columns

Index(['bedroomcnt', 'bathroomcnt', 'calculatedfinishedsquarefeet',
       'taxvaluedollarcnt', 'Name', 'State'],
      dtype='object')

In [6]:
# Renaming the columns
df.rename(columns={'bedroomcnt':'bedroom_count', 'bathroomcnt':'bathroom_count', 'calculatedfinishedsquarefeet':'total_sqft',
       'taxvaluedollarcnt':'tax_amount', 'Name':'county', 'State':'state'}, inplace=True)

In [7]:
df.head(1)

   bedroom_count  bathroom_count  total_sqft  tax_amount       county state
0            3.0             2.0      1458.0    136104.0  Los Angeles    CA

# Drop Missing Values

## Convert zeros to nulls

In [8]:
df.replace(0, np.nan, inplace=True)
df.dropna(inplace=True)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14990 entries, 0 to 15035
Data columns (total 6 columns):
bedroom_count     14990 non-null float64
bathroom_count    14990 non-null float64
total_sqft        14990 non-null float64
tax_amount        14990 non-null float64
county            14990 non-null object
state             14990 non-null object
dtypes: float64(4), object(2)
memory usage: 819.8+ KB

# Module

In [10]:
def drop_columns(df):
    df.drop(columns=['Unnamed: 0','fips', 'FIPS'], inplace=True)
    return df

In [11]:
def rename_columns(df):
    df.rename(columns={'bedroomcnt':'bedroom_count', 'bathroomcnt':'bathroom_count', 'calculatedfinishedsquarefeet':'total_sqft',
       'taxvaluedollarcnt':'tax_amount', 'Name':'county', 'State':'state'}, inplace=True)
    return df

In [12]:
def clean_data(df):
    df.replace(0, np.nan, inplace=True)
    df.dropna(inplace=True)

In [13]:
def wrangle(df):
    df = drop_columns(df)
    df = rename_columns(df)
    df = clean_data(df)
    print('Data Prepared')
    return df

# Test the Functions

In [14]:
test_df = acquire_data()

csv has been previously generated.
Data Acquired

In [15]:
wrangle(test_df)

Data Prepared

In [16]:
test_df.head()

   bedroom_count  bathroom_count  total_sqft  tax_amount       county state
0            3.0             2.0      1458.0    136104.0  Los Angeles    CA
1            2.0             1.0      1421.0     35606.0  Los Angeles    CA
2            3.0             2.0      1650.0    614000.0  Los Angeles    CA
3            2.0             1.0       693.0    274237.0  Los Angeles    CA
5            3.0             2.0      1108.0    486866.0  Los Angeles    CA

# Test the Module

In [17]:
df = acquire_data()

csv has been previously generated.
Data Acquired

In [18]:
wrangle_data(df)

Data Prepared

In [19]:
df.head()

   bedroom_count  bathroom_count  total_sqft  tax_amount       county state
0            3.0             2.0      1458.0    136104.0  Los Angeles    CA
1            2.0             1.0      1421.0     35606.0  Los Angeles    CA
2            3.0             2.0      1650.0    614000.0  Los Angeles    CA
3            2.0             1.0       693.0    274237.0  Los Angeles    CA
5            3.0             2.0      1108.0    486866.0  Los Angeles    CA